{
  "/home":  {
    "panel": {
      "primaryHeader": "UX Design",
      "secondaryHeader": "and Research",
      "pageDescription": "Techniques methodologies and designs for a wide range of projects and problems.",
      "pageLink": "/home/details"
    },
    "details": {
      "panel": {
        "primaryHeader": "Librarians make the best designers",
        "imgPath": "images/profile.jpg"
      },
      "page": {
        "sections": [
          {
            "sectionContent": "I know what you’re thinking: where are the reading glasses and cardigan sweaters? Old stereotypes. With the exception of cardigans, I do wear those."
          },
          {
            "sectionContent": "I have great reference interview skills, a passion for helping people, and can organize your book collection in ways you didn’t know were possible. Package those skills with my ability to translate ideas into solid-gold user interfaces, and you’ve got a great designer."
          },
          {
            "sectionContent": "When I'm not preparing a usability test, you can find me either parked on the couch with my nose in a book or putting up a tent in the great outdoors."
          },
          {
            "sectionContent": "In both cases, you can be sure I’m looking for inspiration from the world around me."
          }
        ]
      },
      "tile": {
        "previous": {
          "primaryHeader": "Front-End",
          "secondaryHeader": "Development"
        },
        "next": {
          "primaryHeader": "Information",
          "secondaryHeader": "Architecture"
        }
      }
    }
  },

  "/information-architecture":  {
    "panel": {
      "primaryHeader": "Information",
      "secondaryHeader": "Architecture",
      "pageDescription": "Content organization and structuring is the key to a successful application or website. Think of it as a card catalog for the 21st century.",
      "pageLink": "/information-architecture/details"
    },
    "details": {
      "panel": {
        "primaryHeader": "Information Architecture",
        "secondaryHeader": "Case Study",
        "pageDescription": "To make an application feel effortless to navigate, it has to have a strong skeleton or foundation. Information architecture is more than just the menu navigation at the top of a website – it’s the map of a product’s parts, and how those parts need to interact with each other. When designing a new feature for an existing product, mapping out those pieces is one of the first steps."
      },
      "page": {
        "sections": [
          {
            "sectionHeader": "The Project",
            "sectionContent": "Through an online survey, we found that our client’s user base spent 75% of their time helping their customers troubleshoot cell phone problems over the phone. Without the ability to see the phone the customer was using, the users were spending more time than was necessary to troubleshoot, and often unable to solve the customer’s problem. The solution was a tool that would allow customers to go into a Target store for in-person device troubleshooting, thereby reducing call volume and duration for our users."
          },
          {
            "sectionHeader": "The Process",
            "sectionContent": ""
          },
          {
            "sectionHeader": "The Results",
            "sectionContent": ""
          }
        ]
      },
      "tile": {
        "previous": {
          "primaryHeader": "About",
          "secondaryHeader": "Laura Cecil"
        },
        "next": {
          "primaryHeader": "Research",
          "secondaryHeader": "Methods"
        }
      }
    }
  },

  "/research-methods":  {
    "panel": {
      "primaryHeader": "Research",
      "secondaryHeader": "Methods",
      "pageDescription": "From A/B Testing to user interviews and everything in between. Choosing the right method for the job is the name of the game here.",
      "pageLink": "/research-methods/details"
    },
    "details": {
      "panel": {
        "primaryHeader": "Research Methods",
        "secondaryHeader": "Designer Tools",
        "pageDescription": "User research is always the first thing I turn to before tackling any project. Understanding both the qualitative and quantitative data behind a project is the key to developing a successful design. Knowing which methods to employ is also half the battle."
      },
      "page": {
        "sections": [
          {
            "sectionHeader": "Usability Testing",
            "sectionContent": "Usability testing is a necessity for all stages of the development process. Preliminary testing of a current interface can help designers understand user pain points and areas of interest, whereas post-release testing monitors whether design implementations were successful. Paper prototyping is my favorite method for gathering iterative feedback during the design lifecycle and avoiding major pitfalls."
          },
          {
            "sectionHeader": "Personas",
            "sectionContent": "Personas are a great tool for getting a team on the same page about who is using the products they are creating. The key to a successful persona is not the physical profile itself, but its adoption from all stakeholders involved and application by a company. I work closely with clients, product owners, developers, and most importantly, end users, to ensure that the personas produced are accurate and useful."
          },
          {
            "sectionHeader": "Card Sorting",
            "sectionContent": "The wrong label can make or break a design. Luckily, a quick card sort is one of the simplest ways to evaluate whether the terms used in a design are terms your users can understand. I use this research method often, either internally or with my end users, to test whether a grouping of information is logical beyond my own assumptions and biases."
          },
          {
            "sectionHeader": "Survey Design",
            "sectionContent": "Surveys help establish both quantitative and qualitative data as a base line before beginning a project, or alternatively, assess whether a design implementation was successful. I find that the key to crafting a useful and accurate survey is to narrow the scope so that the questions are specific and focused on a portion of the product. This reduces the margin for error due to generalities or ambiguity in the survey responses."
          },
          {
            "sectionHeader": "Interviews/Observations",
            "sectionContent": "If the opportunity to have face-to-face time with an end user is available, it can be the most valuable time spent on a project. As a designer, the desire to empathize with my users can only go so far without observing their daily tasks or hearing stories of their struggles with a product. The art of asking questions is a skill I strive to perfect and often helps me answer the “why” when looking at quantitative data or metrics."
          }
        ]
      },
      "tile": {
        "previous": {
          "primaryHeader": "Information",
          "secondaryHeader": "Architecture"
        },
        "next": {
          "primaryHeader": "Visual",
          "secondaryHeader": "Designs"
        }
      }
    }
  },

  "/visual-designs":  {
    "panel": {
      "primaryHeader": "Visual",
      "secondaryHeader": "Designs",
      "pageDescription": "Communicating a design is as important as creating it. Using a quick sketch or pixel perfect visual design depends on what's needed to get the job done.",
      "pageLink": "/visual-designs/details"
    },
    "details": {
      "panel": {
        "primaryHeader": "Visual Designs",
        "secondaryHeader": "Designer Tools",
        "pageDescription": "Discussing UX designs with a development team is the best way to convey the mechanics of a design and thought process that went into it. But at the end of the day, the visual design artifacts I build must be strong enough to convey all the necessary information to the developer."
      },
      "page": {
        "sections": [
          {
            "sectionHeader": "Wireframes",
            "sectionContent": ""
          },
          {
            "sectionHeader": "Prototypes",
            "sectionContent": ""
          },
          {
            "sectionHeader": "High Fidelity Mock-Ups",
            "sectionContent": ""
          }
        ]
      },
      "tile": {
        "previous": {
          "primaryHeader": "Research",
          "secondaryHeader": "Methods"
        },
        "next": {
          "primaryHeader": "Project",
          "secondaryHeader": "Management"
        }
      }
    }
  },

  "/project-management": {
    "panel": {
      "primaryHeader": "Project",
      "secondaryHeader": "Management",
      "pageDescription": "Agile, scrum, sprints, waterfall, kanban: whatever the buzzword of the day is, chances are I've probably tried it.",
      "pageLink": "/project-management/details"
    },
    "details": {
      "panel": {
        "primaryHeader": "Project Management",
        "secondaryHeader": "Case Study",
        "pageDescription": ""
      },
      "page": {
        "sections": [
          {
            "sectionHeader": "The Project",
            "sectionContent": ""
          },
          {
            "sectionHeader": "The Process",
            "sectionContent": ""
          },
          {
            "sectionHeader": "The Results",
            "sectionContent": ""
          }
        ]
      },
      "tile": {
        "previous": {
          "primaryHeader": "Visual",
          "secondaryHeader": "Designs"
        },
        "next": {
          "primaryHeader": "Front-End",
          "secondaryHeader": "Development"
        }
      }
    }
  },

  "/development": {
    "panel": {
      "primaryHeader": "Front-End",
      "secondaryHeader": "Development",
      "pageDescription": "One of the my many hats, it ranges in size from beanie to ten gallon. It's more about the knowledge that I gain from wearing it that makes me a better designer.",
      "pageLink": "/development/details"
    },
    "details": {
      "panel": {
        "primaryHeader": "Front-End Development",
        "secondaryHeader": "Case Study",
        "pageDescription": ""
      },
      "page": {
        "sections": [
          {
            "sectionHeader": "The Project",
            "sectionContent": ""
          },
          {
            "sectionHeader": "The Process",
            "sectionContent": ""
          },
          {
            "sectionHeader": "The Results",
            "sectionContent": ""
          }
        ]
      },
      "tile": {
        "previous": {
          "primaryHeader": "Project",
          "secondaryHeader": "Management"
        },
        "next": {
          "primaryHeader": "About",
          "secondaryHeader": "Laura Cecil"
        }
      }
    }
  }
}
